{"id":4037,"date":"2022-11-07T12:02:10","date_gmt":"2022-11-07T12:02:10","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4037"},"modified":"2023-06-12T05:44:41","modified_gmt":"2023-06-12T05:44:41","slug":"new-mobility-boost-to-put-sohna-realty-on-fasttrack","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/new-mobility-boost-to-put-sohna-realty-on-fasttrack\/","title":{"rendered":"New mobility boost to put Sohna realty  on fasttrack"},"content":{"rendered":"\n<p>The National Highway Authority of India&#8217;s (NHAI)&nbsp; is putting into motion its plan to&nbsp; fast track traffic on Sohna&nbsp; Road to benefit people living on both sides of the newly constructed Sohna elevated road. On anvil is a plan to construct an underpass and a slip road to unclog Sohna Road to ensure smooth and fast traffic on this prime real estate corridor of South of Gurgaon.<\/p>\n\n\n\n<p>As per the plan, an underpass will be constructed at Vatika Chowk to ensure uninterrupted&nbsp; movement of vehicles on Southern Peripheral Road (SPR) which intersects Sohna Road at this crucial junction which has the high concentration of traffic The construction of a slip road will be done at Shishpal Vihar T Point in order to ensure easy entry and exit&nbsp; from Sohna road for commuters going towards Shishpal Vihar. The traffic will also be streamlined under Sohna elevated road by tackling congestion at Tikri Cut, Shishpal Vihar T Point and Vatika Chowk by effecting changes in design and engineering.&nbsp;<\/p>\n\n\n\n<p>Only recently Sohna&#8217;s connectivity got a boost with Gurugram Metropolitan City Bus Limited(GMCBL) launching a new bus service between Huda City Centre Metro Station and Sohna Bus Terminal. This bus route&nbsp; provided connectivity&nbsp;boost&nbsp; to many areas with high footfall like Ardee City, Mayfield Garden, Park hospital, Vatika Chowk, Damdama etc in South of Gurgaon. Earlier, the operationalisation of 6-lane access-controlled elevated expressway linking Rajiv Chowk, Gurgaon (NH8) with Sohna , had considerably reduced&nbsp;congestion and travel time, providing connectivity impetus to residential and commercial developments along Sohna Road .&nbsp;<\/p>\n\n\n\n<p>The improved connectivity in South of Gurgaon has been providing a boost to the area&nbsp; as an emerging&nbsp; logistics and warehousing hub with well known companies like Amazon, Flipkart, Myntra, Uniqlo, H&amp;M as there is a quick access to Delhi, Faridabad, Noida, Ghaziabad&nbsp;and beyond. Warehousing companies are taking advantage of proximity to highways, expressways like NH8, NH248A, KMP Eway, Delhi-Mumbai Expressway. Indospace already has a 51 acre Logistics Park and global logistics firm, ESR has planned to develop a 76-acre logistics park.<\/p>\n\n\n\n<p>Sohna&#8217;s strategic location and excellent connectivity  makes it a superior real estate destination in the NCR, offering end-users and investors a wide choice of properties in the form of apartments, independent floors and villas at different price points. As HSVP is coming up with a 500 acre mega residential and commercial hub, in Sector 35-36 Sohna, this will make this macro market all the more attractive. The upcoming connectivity to  new ISBT and metro station on Vatika Chowk along with the new mobility plan  will further accelerate real estate and infrastructural developments, thereby pushing up the livability index of the area. This inturn will increase the attractiveness of , South of Gurgaon as a hot destination for investors. The easier and faster road connectivity will further beef up real estate investment of the area, leading to property appreciation which has seen double-digit growth.<gwmw style=\"display:none;\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The National Highway Authority of India&#8217;s (NHAI)&nbsp; is putting into motion its plan to&nbsp; fast track traffic on Sohna&nbsp; Road to benefit people living on both sides of the newly constructed Sohna elevated road. On anvil is a plan to construct an underpass and a slip road to unclog Sohna Road to ensure smooth and&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4038,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4037"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4037"}],"version-history":[{"count":2,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4037\/revisions"}],"predecessor-version":[{"id":4042,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4037\/revisions\/4042"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4038"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4037"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4037"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4037"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}