{"id":4043,"date":"2022-11-07T12:06:35","date_gmt":"2022-11-07T12:06:35","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4043"},"modified":"2023-06-12T06:14:53","modified_gmt":"2023-06-12T06:14:53","slug":"new-metro-corridors-to-provide-big-connectivity-boost-to-gurgaon-realty","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/new-metro-corridors-to-provide-big-connectivity-boost-to-gurgaon-realty\/","title":{"rendered":"New Metro corridors to provide big connectivity boost to Gurgaon realty"},"content":{"rendered":"\n<p>With the two key metro corridors in the Millennium City , spanning 38 km set to get&nbsp; centre state cabinet nods ,the stage will be set for Gurgaon real estate to get&nbsp; a major connectivity boost. The two corridors include extension of Delhi Metro Yellow Line from Huda City Centre Metro Station to Cyber City and&nbsp; the Delhi Metro link connecting Palam Vihar with Dwarka in Delhi.<\/p>\n\n\n\n<p>These two metro corridors assume great significance from the connectivity point of view in Gurgaon especially as Delhi Metro Yellow Line and Rapid Metro&#8217;s&nbsp; &nbsp;reach is very limited in the city. The 49 km long Delhi Metro Yellow line starting from Samaypur Badli in Delhi reached Huda City Centre Metro Station in 2010. From Delhi border at Arjangarh, it covers just about 5 km upto Huda City Centre through Guru Dronacharya, Sikanderpur, MG Road and Iffco Chowk metro stations. Since 2010, not an inch has been added to this line in Gurgaon. On the other hand Gurgaon Rapid Metro Network&nbsp; also has a limited length of over 12 km. Built by Rapid Metro Gurgaon Limited (RMGL), this privately funded light rapid transit system&nbsp; now run by Delhi Metro, opened in 2013 with the first phase covering a length of over 5 km in north of Sikanderpur. The second phase&nbsp; of about 7 km&nbsp; &nbsp;which became operational in 2017 had a southward extension from Sikanderpur to Sector 55-56. This section&nbsp; was partially opened in 2017 till Sector 53-54 while the two remaining stations- Sector 55-56&nbsp;were added later.<\/p>\n\n\n\n<p>The 8.4 km&nbsp; Palam Vihar Dwarka metro line has a 4.4 km portion that falls in Gurgaon . Passing throughRezang La Chowk, Choma, Sector 110 and Sector 11, it will provide a major metro link to Dwarka Expressway. The remaining 4 km of this line falls in Delhi, covering Dwarka Sector 28, Dwarka Sector 25 and Dwarka Sector 21.<\/p>\n\n\n\n<p>The second metro line that will come up in Gurgaon is a 30 km Huda City Centre- Cyber City corridor. Approved by the Haryana cabinet in 2020, this elevated metro line will have 27 stations. The line will cover most of the busiest and densely populated areas, passing through Sector 45, Cyber Park, Sector 47, Subhash Chowk, Sector 48, Sector 72A, Hero Honda Chowk, Sector 10, Sector 37, Basai, Sector, 97, 4,5, Ashok Vihar, Sector 3, Bajghera Road, Palam Vihar Extension, Palam Vihar, Sector 23A, Sector 22 and Udyog Vihar Phase 4,5 and 6.<\/p>\n\n\n\n<p>Meanwhile, the Haryana Mass Rapid Transport Corporation (HMRTC) has asked Gurgaon Metropolitan Development Authority (GMDA) to widen major roads that fall in the alignment of Huda City Centre &#8211; Cyber City corridor, to facilitate the construction of this flagship metro line . With all this in the offing, Gurgaon real estate will get wings in the coming times through this major metro connectivity boost.<gwmw style=\"display:none;\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the two key metro corridors in the Millennium City , spanning 38 km set to get&nbsp; centre state cabinet nods ,the stage will be set for Gurgaon real estate to get&nbsp; a major connectivity boost. The two corridors include extension of Delhi Metro Yellow Line from Huda City Centre Metro Station to Cyber City&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4044,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4043"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4043"}],"version-history":[{"count":2,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4043\/revisions"}],"predecessor-version":[{"id":4046,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4043\/revisions\/4046"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4044"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4043"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4043"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4043"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}