{"id":4083,"date":"2022-11-10T09:19:53","date_gmt":"2022-11-10T09:19:53","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4083"},"modified":"2023-06-12T06:15:49","modified_gmt":"2023-06-12T06:15:49","slug":"new-infra-projects-to-enhance-dwarka-eway-connectivity-boost-investment","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/new-infra-projects-to-enhance-dwarka-eway-connectivity-boost-investment\/","title":{"rendered":"New infra projects to enhance Dwarka Eway connectivity, boost investment"},"content":{"rendered":"\n<p>A host of new infrastructure development projects in and around Dwarka Expressway are set to provide a big connectivity boost to this prime expressway of Gurgaon which is all set to become operational next year. This will in turn result in&nbsp; property price appreciation in the area.<\/p>\n\n\n\n<p>The opening of one of these projects- Basai flyover will&nbsp; further enhance the connectivity of Dwarka Expressway , giving real estate&nbsp;along this longest elevated urban road a big boost. Though the formal inauguration will take place later, the flyover has been opened to traffic to observe vehicular movement in actual conditions and real time.<\/p>\n\n\n\n<p>Built at a cost of Rs 110 crore, this half a kilometre long flyover , will reduce congestion in the area, ease commuting, thereby benefiting&nbsp;thousands of residents&nbsp; living in highrise buildings along Dwarka expressway&nbsp; &nbsp;The Basai flyover will improve&nbsp; Dwarka Expressway connectivity with other parts of the city. To further ease vehicular movements towards Dwarka expressway, National Highway Authority of India (NHAI) will be preparing a report to construct an elevated&nbsp; road between Umang Bhardwaj Chowk and Hero Honda Chowk . This will significantly improve Dwarka Expressway connectivity with NH8.The city&#8217;s first full cloverleaf flyover is likely to be completed by December end. This will link SPR, CPR and Delhi-Gurgaon Expressway. SPR meets Delhi-Gurgaon Expressway near Kherki Daula. NPR (Dwarka Expressway) is near Delhi- Gurgaon expressway. With the construction of this cloverleaf, the Gurgaon portion of Dwarka Expressway will get completed , providing a very big benefit to the residents living in the residential societies along the expressway.<\/p>\n\n\n\n<p>Meanwhile, the Dhanwapur railway underpass of Delhi-Rewari rail line in Sector 104, Dwarka Expressway is getting ready. The underpass will connect Old Gurugram sectors and Palam Vihar with new sectors along Dwarka Expressway.&nbsp; The expressway will also get connectivity push with the proposed construction of service roads. The Gurgaon Metropolitan Development Authority(GMDA) has floated a tender for&nbsp;the construction of service roads along both sides of Dwarka Expressway. These service roads, which&nbsp; will come up along&nbsp; a 15 km long stretch from Central Peripheral Road(CPR) to Delhi border, will ensure better connectivity to sectors along the expressway.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Dwarka Expressway is set to benefit from rail infra upgrade in the city. The existing railway station of Gurgaon (10 minutes drive )&nbsp; will get a major revamp under which infrastructure&nbsp; at the railway station will be upgraded to handle more passengers and tracks&nbsp; by constructing fourth railway platform, besides expanding the existing platform and increasing the number of entry and exit points&nbsp; of the station. There is also a plan for the construction of another railway station&nbsp; along the Dwarka Expressway to cater to large population already living in recently developed sectors in New Gurgaon including Dwarka Expressway . The electrification of Delhi-Gurgaon &#8211; Jaipur rail line is already underway while electrification of railway line between Garhi Harsaru and Farrukhnagar is completed .<\/p>\n\n\n\n<p>The Metro connectivity project of Dwarka Expressway to be undertaken by Haryana Mass Rapid Transport Corporation&nbsp; is likely to start soon. Dwarka Expressway will get metro link through the extension of Metro line from Huda city centre to Old Gurgaon via Hero Honda Chowk, Sector 9, 4, 23&nbsp; and Palam Vihar&nbsp; Dwarka Expressway&#8217;s metro link will prove to be a big booster for its connectivity with Gurgaon&#8217;s top residential, commercial , employment and recreation hubs.&nbsp;<\/p>\n\n\n\n<p>GMDA is raising its monthly spending on infrastructural development to Rs 100 crore. The augmentation of infrastructure in and around Dwarka Expressway will give a major boost to real estate development in the area which has already emerged as a hot ireal estate investment   corridor of Gurgaon.<gwmw style=\"display:none;\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A host of new infrastructure development projects in and around Dwarka Expressway are set to provide a big connectivity boost to this prime expressway of Gurgaon which is all set to become operational next year. This will in turn result in&nbsp; property price appreciation in the area. The opening of one of these projects- Basai&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4085,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4083"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4083"}],"version-history":[{"count":2,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4083\/revisions"}],"predecessor-version":[{"id":4091,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4083\/revisions\/4091"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4085"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4083"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4083"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4083"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}