{"id":4107,"date":"2022-11-10T10:54:15","date_gmt":"2022-11-10T10:54:15","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4107"},"modified":"2023-06-12T06:18:03","modified_gmt":"2023-06-12T06:18:03","slug":"high-home-buying-sentiment-fueling-residential-sales","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/high-home-buying-sentiment-fueling-residential-sales\/","title":{"rendered":"High home buying sentiment fueling residential sales"},"content":{"rendered":"\n<p>Despite being prone to rising interest regime, the rate sensitive real estate sector, particularly residential realty is experiencing robust sales due to strong sentiment for home ownership, rising number of new launches amidst manageable inventory.<\/p>\n\n\n\n<p>The healthy residential sales momentum is marked by the highest sales number for residential real estate after 2010. The January- September 2022 period registered sales of 161000 units and the projections for the full year top 2000000 units. This according to JLL, will be 56 percent higher than last year&#8217;s sales figure. As per Anarock data, sales of residential properties across top 7 cities including Delhi-NCR, Mumbai Metropolitan Region (MMR) , Chennai, Kolkata, Bengaluru, Pune and Hyderabad rose 41 percent year on year.&nbsp;&nbsp;<\/p>\n\n\n\n<p>This positive performance is reflected in the equity shares of real estate companies as well. Against an 8 percent surge in Nifty 50 and S&amp;P BSE Index , shares of top listed companies have gone up by over 28 percent in the July- September quarter. Seen in the backdrop of&nbsp; firming up of interest rates and up to 10 percent&nbsp; increase in home prices across a portfolio of projects , this is quite creditable&nbsp;performance.<\/p>\n\n\n\n<p>The robust home sales amidst high demand&nbsp; and reducing inventory ,are reflected in a healthy increase in the number of new launches.&nbsp; The top 7 cities witnessed new launches of&nbsp; 62000 apartments in the third quarter of 2022, recording an increase of 3 percent QoQ , as per JLL report findings. What is significant about these new launches is that developers are tailoring their projects as per the choice and preferences of home buyers. Keeping in view the post-covid requirements of spacious premium homes with top amenities and high quotient of sustainability and wellness , developers are offering such products to lure prospective home buyers. And these tailor-made&nbsp; products with lucrative launch&nbsp;offers , in turn are pushing up housing demand and sales.<\/p>\n\n\n\n<p>As the new supply by the developers across India is getting a very good response, developers have planned a strong pipeline of&nbsp; new launches in millions of sq ft, beyond festive season to cash in on the sales momentum. Especially when the trend of home ownership is gaining further strength. As such despite hiccups, a strong finish is expected in the second half of the year which will help continue the momentum through the new year.&nbsp;<\/p>\n\n\n\n<p><gwmw style=\"display:none;\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Despite being prone to rising interest regime, the rate sensitive real estate sector, particularly residential realty is experiencing robust sales due to strong sentiment for home ownership, rising number of new launches amidst manageable inventory. The healthy residential sales momentum is marked by the highest sales number for residential real estate after 2010. The January-&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4108,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4107"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4107"}],"version-history":[{"count":2,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4107\/revisions"}],"predecessor-version":[{"id":4110,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4107\/revisions\/4110"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4108"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4107"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4107"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4107"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}