{"id":4132,"date":"2022-11-16T05:57:33","date_gmt":"2022-11-16T05:57:33","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4132"},"modified":"2023-06-12T05:48:21","modified_gmt":"2023-06-12T05:48:21","slug":"high-credit-to-realty-companies-and-home-buyers-to-boost-real-estate","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/high-credit-to-realty-companies-and-home-buyers-to-boost-real-estate\/","title":{"rendered":"High credit to realty companies and home buyers to boost real estate"},"content":{"rendered":"\n<p>The significant growth in retail credit for home buyers, and corporate credit to real estate companies, will have a positive impact on the growth of real estate, particularly in general and residential real estate.<\/p>\n\n\n\n<p>Both the bank credit and non-bank (NBFCs) credit for home buyers and real estate\/ construction companies has seen the fastest growth. According to industry statistics, the credit for companies\/industries grew the fastest in September 2022, due to a surge in demand for working capital over the past eight years.<\/p>\n\n\n\n<p>The Reserve Bank of India&#8217;s (RBI) latest sectoral deployment data indicates that the credit to industries\/corporates has shot up to Rs 32.4 trillion, registering a 12.6 percent year on year growth. The RBI&#8217;s figures indicate that the construction companies and allied sector companies dealing in steel and cement are the key drivers of credit growth. Post-Covid, the working capital loans that had contracted during the pandemic, are now on the rise. In view of the turbulent stock market, companies have been preferring bank credit and loans from NBFCs. High inflation had resulted in higher demand for working capital loans from companies. Public sector banks saw the aggregate loan growth improve to 8.8 percent in the financial year 2022, the highest since 2013-14.<\/p>\n\n\n\n<p>On one hand, the corporate loan book is swelling, while on the other, retail loan (largely home loan) is significantly increasing. HDFC, the largest private mortgage financer, has seen its retail loan demand at an 8-year high. In Q2 2022, individual disbursements were to the tune of Rs 43000 crore, up by 2 percent sequentially and 13 percent, year on year. Disbursements in the individual segment grew by 36 percent year on year to Rs 44000 crore. Individual loans comprise 81 percent of the Rs 6.9 trillion of assets under management(AUM). State Bank of India, the leading public sector bank, has seen retail loans growing by 18.84 percent, while corporate loans registering a growth of 21.8 percent.<\/p>\n\n\n\n<p>NBFCs and HFCs have also seen a spurt in retail loans and home loans, with strong demand from Tier 2 and Tier 3 cities. LIC Housing Finance is leveraging high demand for the affordable housing segment. It has an overall loan growth guidance of 15 percent across the full financial year. In view of the robust demand from Tier 2 and Tier 3 cities, Sundram Home Finance is raising up to Rs 4500 crore to expand its loan book. It aims to disburse Rs 3500 crore in the current fiscal, up from Rs 2350 crore in the last financial year.<\/p>\n\n\n\n<p>What is all the more heartening is that unlike in the past, credit growth this time is quite broad based. According to leading rating agency Crisil, healthy economic growth and budgetary support from the government should further provide a push to bank credit growth by 2-3 percent to 11-12 percent in 2022-23. Thus, this high credit demand from corporates and home buyers will bode well for the real estate, especially the residential segment.<gwmw style=\"display:none;\"><\/p>\n\n\n\n<p><gwmw style=\"display:none;\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The significant growth in retail credit for home buyers, and corporate credit to real estate companies, will have a positive impact on the growth of real estate, particularly in general and residential real estate. Both the bank credit and non-bank (NBFCs) credit for home buyers and real estate\/ construction companies has seen the fastest growth&#8230;.<\/p>\n","protected":false},"author":1,"featured_media":4133,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4132"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4132"}],"version-history":[{"count":1,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4132\/revisions"}],"predecessor-version":[{"id":4134,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4132\/revisions\/4134"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4133"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4132"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4132"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4132"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}