{"id":4148,"date":"2022-11-19T05:16:48","date_gmt":"2022-11-19T05:16:48","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4148"},"modified":"2023-06-12T05:49:56","modified_gmt":"2023-06-12T05:49:56","slug":"gurgaon-jaipur-stretch-of-delhi-mumbai-eway-to-boost-sohna-realty","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/gurgaon-jaipur-stretch-of-delhi-mumbai-eway-to-boost-sohna-realty\/","title":{"rendered":"Gurgaon- Jaipur stretch of Delhi-Mumbai Eway to boost Sohna Realty"},"content":{"rendered":"\n<p>With the Gurgaon-Jaipur stretch of the mega 1352 km long Delhi-Gurgaon-Mumbai expressway getting operational later this month, the South of Gurgaon (Sohna) real estate is set to get a major boost.<\/p>\n\n\n\n<p>This 8-lane access-controlled expressway will fast-track Gurgaon-Sohna-Jaipur connectivity, by effectively reducing the travelling time to Jaipur to two and a half hours. Gurgaon-Sohna-Jaipur stretch of the Delhi-Mumbai expressway is the first corridor to get operational. This will follow the operationalization of the crucial six-lane elevated access-controlled expressway between Rajiv Chowk (NH8 Gurgaon) and Sohna. This elevated road has already provided a great connectivity boost to Sohna&#8217;s real estate micro market.<\/p>\n\n\n\n<p>The National Highway Authority of India (NHAI) is now further revamping the Sohna elevated expressway through a slip road and an underpass at Vatika Chowk, where Sohna Road intersects Southern Peripheral Road (SPR). This will put an end to congestion and ensure smooth and speedier traffic on the premier real estate corridor of the National Capital Region (NCR), benefitting hundreds of thousands of people living in residential societies on both sides of the expressway.<\/p>\n\n\n\n<p>Sohna, which already enjoys the advantage of strategic location due to close connectivity with NH8, NH248A, and Kundli-Manesar-Palwal expressway, will get further boost with improved connectivity. This will prove to be a booster for the logistics and warehousing business which has already taken roots in the region. Also, once the work on the DND and Jewar Airport, and Greater Noida links get completed in a couple of years, the entire NCR including Gurgaon, Sohna, Faridabad, Noida and Greater Noida will get immensely benefited in terms of real estate development.<gwmw style=\"display:none;\"><\/p>\n\n\n\n<p><gwmw style=\"display:none;\"><\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the Gurgaon-Jaipur stretch of the mega 1352 km long Delhi-Gurgaon-Mumbai expressway getting operational later this month, the South of Gurgaon (Sohna) real estate is set to get a major boost. This 8-lane access-controlled expressway will fast-track Gurgaon-Sohna-Jaipur connectivity, by effectively reducing the travelling time to Jaipur to two and a half hours. Gurgaon-Sohna-Jaipur stretch&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4149,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4148"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4148"}],"version-history":[{"count":2,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4148\/revisions"}],"predecessor-version":[{"id":4160,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4148\/revisions\/4160"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4149"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4148"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4148"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4148"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}