{"id":4236,"date":"2023-02-06T05:10:00","date_gmt":"2023-02-06T05:10:00","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4236"},"modified":"2023-06-12T06:24:55","modified_gmt":"2023-06-12T06:24:55","slug":"residential-realty-set-to-chart-high-growth-path-2","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/residential-realty-set-to-chart-high-growth-path-2\/","title":{"rendered":"Residential Realty Set to Chart High Growth Path"},"content":{"rendered":"\n<p>Despite home affordability getting a hit in 2022, particularly during the second half of the year due to a rise in capital values and a sharp rise in interest rates, the stellar performance given by the housing&nbsp;sector paves the way for a high growth path ahead.<\/p>\n\n\n\n<p>According to leading property consultancies, 2022 has proved to be a watershed year for Indian real estate as, despite high home loan&nbsp;rates, sales velocity got strengthened, setting the decadal benchmark. What&#8217;s really remarkable is that though interest rates saw a sharp increase in H2, residential realty gave the best performance in the last 18 half-year blocks. While&nbsp;global realty consultancy&nbsp;put the yearly growth of 34% in housing sales, Anarock and JLL respectively put the yearly growth at 54%, and 68%. The strong uptick in sales saw a considerable dip in inventory, with a quarter-to-sell (QTS0 level going down to 7.2 quarters in H2 2022&nbsp;from 10.2 quarters in H2 2021.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Besides the surge in sales, the high growth in residential supply&nbsp;has boosted the confidence of home buyers. As per Knight Frank, there was a 41% Y-o-Y increase in new launches. Anarock puts the growth of new supply across 7 top cities&nbsp;at 51%. NCR is one of the top regions which have witnessed a strong home-buying sentiment among home buyers throughout the year.&nbsp;<\/p>\n\n\n\n<p>The price increment seen in pan India also points to the healthy residential market with stable demand-supply dynamics. Mumbai, NCR, Bangalore and Pune registered increments of 7% each. Chennai and Hyderabad witnessed a significant increase of 6%, while Kolkata and Ahmedabad had a 4% increase.&nbsp;<\/p>\n\n\n\n<p>Premium housing continues to be a significant growth driver. Housing units&nbsp;costing above Rs 1 crore have seen growth from 23% in H2 2021 to 28% in H2 2022. Units between Rs 50 lakh to 1 crore also witnessed growth from 35% to 37% in H2 2022. This came at the cost of affordable&nbsp;housing, which saw a dip from 41% in H2 2021 to 35% in H2 2022. The 2-3 BR units are the biggest demand drivers&nbsp;and are most preferred by home buyers across 12 top cities. This momentum goes on, especially as most of the home buyers are end-users.&nbsp;<\/p>\n\n\n\n<p>Declining inventory, together with higher completions, has boosted the buying sentiment of home buyers. This is evident from their growing faith in even under-construction housing projects. The under-construction residential projects of financially strong big branded developers with a good track record of deliveries have been gaining traction as there is little development risk. Moreover, the attractiveness of under-construction residential units has gone up as developers are coming up with tailor-made homes as per the needs and preferences of home buyers.&nbsp;<\/p>\n\n\n\n<p>This traction continues to be there as the property has seen good appreciation. As per Magicbricks PropIndex Report, the December 2022 quarter saw residential property appreciating by 13.9%. Moreover, investments in real estate&nbsp;are preferred as the realty market is more stable compared to the equity market.&nbsp;Institutional investments are also boosting residential real estate. Investments by family offices, foreign corporate groups, foreign banks, pension funds, private equity, real estate funds cum developers, foreign-funded NBFCs and sovereign&nbsp;wealth funds are increasingly gaining traction. The residential sector has shown a strong performance by garnering a 30% share of overall investments to the tune of&nbsp;USD 1564 million (Rs 11440 crore) compared to USD 1081 million (Rs 7999 crore)<\/p>\n\n\n\n<p>Going forward, the moderating inflation bodes well for residential real estate growth as there are prospects of a halt to the cycle of interest rate hikes by the RBI in the second quarter of FY24. Moreover, the healthy economy (global agencies putting FY 23 and FY 24 growth at 7% and 6%, respectively)&nbsp;and positive business sentiment will support the growth of residential real estate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Despite home affordability getting a hit in 2022, particularly during the second half of the year due to a rise in capital values and a sharp rise in interest rates, the stellar performance given by the housing&nbsp;sector paves the way for a high growth path ahead. According to leading property consultancies, 2022 has proved to&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4410,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4236"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4236"}],"version-history":[{"count":7,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4236\/revisions"}],"predecessor-version":[{"id":4375,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4236\/revisions\/4375"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4410"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4236"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4236"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4236"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}