{"id":4396,"date":"2023-02-07T04:29:04","date_gmt":"2023-02-07T04:29:04","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4396"},"modified":"2023-06-12T06:21:17","modified_gmt":"2023-06-12T06:21:17","slug":"delhi-metro-extension-to-provide-wings-to-gurgaon-realty","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/delhi-metro-extension-to-provide-wings-to-gurgaon-realty\/","title":{"rendered":"<strong>Delhi Metro Extension to Provide Wings to Gurgaon Realty<\/strong>"},"content":{"rendered":"\n<p>With the onset of the New Year, the groundwork on the proposed extension of Delhi Metro from Huda City Centre to Cyber City, covering most of the city, including Old Gurgaon, is picking up speed, paving the way for&nbsp;providing wings to Gurgaon realty.&nbsp;<\/p>\n\n\n\n<p>The Delhi Metro Extension Plan will be getting impetus by way of the appointment of&nbsp;a design consultant. The process for the appointment of&nbsp;a design consultant has already been completed by the Haryana&nbsp;Mass Rapid Transport Corporation Limited (HMRTC) ahead of a final nod to the extension plan by the Centre.&nbsp; The consultant will&nbsp;design and plan the metro stations, complete with foot over bridges and culverts and lay out plans for stations, including electrical and mechanical services.&nbsp;The consultant will also be responsible for designing ancillary&nbsp;buildings and private&nbsp;spaces along&nbsp;with the integration of existing and proposed property developments. He will be providing design solutions for public&nbsp;and private transport,&nbsp;traffic management plans&nbsp;and property developments at the metro stations.&nbsp; From next month, the work for the soil testing will&nbsp;be initiated by HMRTC. And bids for the metro extension project will be submitted between July 15 and 26.&nbsp;<\/p>\n\n\n\n<p>The 29 km long proposed route with over two dozen metro stations approved by the Haryana government in August 2020, will pass through Sector 45 Cyber Park, District Shopping Centre, Sector 47, Subhash Chowk, Sector 48, Sector 72A, Hero Honda Chowk, Udyog Vihar Phase 6, Sector 10, Sector 37, Basai Village, Sector 9, Sector 7, Sector 4, Sector 5, Ashok Vihar, Sector 3, Bajghera Road, Palam Vihar, Sector 23A, Sector 22, Udyog Vihar Phase 5 before merging into an existing metro network of Rapid Monorail at Moulsari Avenue Station near Cyber City The line will pass right by the Dwarka Expressway. At Udyog Vihar, the line will have an interchange facility to switch over to the 106 km Delhi-SNB RRTLine which will be connecting Delhi&#8217;s Sarai Kale Khan with Shahjahanpur, Neemrana and Behror in Rajasthan through 17 stations.<\/p>\n\n\n\n<p>The entire project&nbsp;for Metro Extension will take four years to complete construction. Since there will be an interchange at Huda City Centre, the extension line will provide direct connectivity to a large part of Gurgaon with Delhi, thereby giving a big boost to real estate in the city.&nbsp;&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With the onset of the New Year, the groundwork on the proposed extension of Delhi Metro from Huda City Centre to Cyber City, covering most of the city, including Old Gurgaon, is picking up speed, paving the way for&nbsp;providing wings to Gurgaon realty.&nbsp; The Delhi Metro Extension Plan will be getting impetus by way of&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4412,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4396"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4396"}],"version-history":[{"count":2,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4396\/revisions"}],"predecessor-version":[{"id":4411,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4396\/revisions\/4411"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4412"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4396"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4396"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4396"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}