{"id":4436,"date":"2023-02-07T10:06:59","date_gmt":"2023-02-07T10:06:59","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4436"},"modified":"2023-06-12T05:45:24","modified_gmt":"2023-06-12T05:45:24","slug":"real-estate-remains-an-attractive-asset-class-for-investors","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/real-estate-remains-an-attractive-asset-class-for-investors\/","title":{"rendered":"<strong>Real Estate Remains An Attractive Asset Class For Investors<\/strong>"},"content":{"rendered":"\n<p>Despite all the domestic and worldwide&nbsp;headwinds in the form of&nbsp;global recession, inflation and rising interest rates, the real estate sector in India has emerged resilient and resurgent. Particularly after receiving the&nbsp;severe setback during the post-covid years of 2020 and 2021, Indian real estate has made a remarkable recovery&nbsp;to firmly retain its position as an attractive asset class for both domestic and international investors.&nbsp;<\/p>\n\n\n\n<p>It is an encouraging trend that institutional investments, despite global&nbsp;geo-political tensions, touched USD 5.2 billion (Rs 38,480 crore), registering a yearly increase of 19%. The platform commitments registered a 174% yearly increase&nbsp;with residential real estate recording a 24% increase in joint platforms for investment.<\/p>\n\n\n\n<p>Delhi- NCR has topped in the region-wise investments with a growth rate of 170%, followed by MMR at 32%, Bangalore at 17%, Hyderabad at 6% and Chennai at 4%.&nbsp; The US continent tops with a fund flow share of 49%, followed by the APAC region at 40% and the Middle East at 11%.&nbsp; The share of domestic investment inflows in 2022 surpassed the share in 2021, accounting for a 22% share in total inflows, with a large percentage of residential investments.<\/p>\n\n\n\n<p>In this positive growth story of real estate investments, the residential segment has given stellar performance. Setting a decadal record of sales, the residential real has garnered 30% of overall investments, coming close to the commercial office segment that has the highest share of 36%. Among the global investors, GIC, CPPIB, Brookfield and ADIA are involved in top deals with developers like Bhartiya Urban, Tata Realty &amp; Infrastructure, and Bharti Realty. The investment share of residential realty is five times more than that of retail real estate.&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<p>Policy reforms in real estate, housing and infrastructure sector, besides infrastructure upgradation, are driving investments in real estate. The government has put in place a liberal and transparent system wherein most sectors&nbsp;including real estate, are open for FDI under an automatic route. The reforms to promote ease of doing business have also made strides. The government&#8217;s policy to pitch India&nbsp;as an alternative manufacturing destination with production-linked schemes has paid rich dividends. The Rs 100 lakh crore National Investment Pipeline and PM Gati Shakti Programme for coordinated planning and execution of infrastructure projects have proved to be a big confidence booster for investors.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Despite all the domestic and worldwide&nbsp;headwinds in the form of&nbsp;global recession, inflation and rising interest rates, the real estate sector in India has emerged resilient and resurgent. Particularly after receiving the&nbsp;severe setback during the post-covid years of 2020 and 2021, Indian real estate has made a remarkable recovery&nbsp;to firmly retain its position as an attractive&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4437,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4436"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4436"}],"version-history":[{"count":2,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4436\/revisions"}],"predecessor-version":[{"id":4922,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4436\/revisions\/4922"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4437"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4436"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4436"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4436"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}