{"id":4789,"date":"2023-04-24T05:28:58","date_gmt":"2023-04-24T05:28:58","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4789"},"modified":"2023-06-12T06:25:46","modified_gmt":"2023-06-12T06:25:46","slug":"credai-partners-with-igbc-to-construct-4000-green-project","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/credai-partners-with-igbc-to-construct-4000-green-project\/","title":{"rendered":"CREDAI partners with IGBC to construct 4000 green project, it’s a welcome step, industry players should come forward to play their role"},"content":{"rendered":"\n<p>Having our own well built-up small or big gated or not in urban cities for a better future for our kids and their education is the choice of every single individual and family, specially in a country like India<br>where population is surpassing in unbelievable manner every passing day. This sounds good that people are becoming conscious to secure their kids’ future by having at least one dwelling unit and thus our living standard is also on rise and this also is prompting the government to rethink sustainable housing policies from time to time. Yes, we are developing and thereby our country is also developing and we are proud of it.<\/p>\n\n\n\n<p>The more we develop the more duties and responsibilities we own up, thereby. This is fact and this fact is with every person, every city and every country existing on the globe. And we are as much duty and<br>responsibility bound to our kids’ future as we are to protect our climate which is under serious threat. And we cannot secure sustainable development for our future at the cost of losses or damages to our<br>climate; this is unavoidable.<\/p>\n\n\n\n<p>And climate change is a global concern, now, due to emissions of greenhouse gas and it is our duty and responsibility to help reduce greenhouse gas for a better sustainable environment. The Intergovernmental Panel on Climate Change (IPCC), a body of the United Nations, expressed its concern recently as it has been doing, while releasing a report in this regard, while underscoring the urgency of taking more ambitious action to secure a livable sustainable future.<\/p>\n\n\n\n<p>In the real estate terms, green building concept is the need of the time since the real estate industry is the one of the biggest contributor to the overall development of the world and thereby to the global climate<br>change as well and that way we appreciate the Confederation of Real Estate Industry of India (Credai) has partnered with the Indian Green Building Council (IGBC) to construct four thousand green projects – it<br>is a welcoming move aimed at sustainable built environment.<\/p>\n\n\n\n<p>We must think of a society or a building unit producing zero waste – zero water, sewer, garbage, debris etc discharge; zero or minimum electricity consumption with maximum utility, hundred percent in built<br>system of waste recycling waste materials into re-usable things and energies etc and a building built up on concept of fully green building theme – this all is going to be reality of the day and it is the need<br>of the day to protect our environment and secure sustainable development in city we live in.<\/p>\n\n\n\n<p>We congratulate the CREDAI for the move and we also assure to be abide by all its guidelines that we will adapt in our projects as we have already been doing in letter and spirit and we also trust this step of<br>CREDAI would definitely would help meeting the objective set by the of the United Nations’ body such as IPCC to reduce greenhouse gas.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Having our own well built-up small or big gated or not in urban cities for a better future for our kids and their education is the choice of every single individual and family, specially in a country like Indiawhere population is surpassing in unbelievable manner every passing day. This sounds good that people are becoming&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4795,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4789"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4789"}],"version-history":[{"count":2,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4789\/revisions"}],"predecessor-version":[{"id":4805,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4789\/revisions\/4805"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4795"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4789"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4789"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4789"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}