{"id":4814,"date":"2023-05-08T09:14:34","date_gmt":"2023-05-08T09:14:34","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4814"},"modified":"2023-06-12T05:40:39","modified_gmt":"2023-06-12T05:40:39","slug":"signature-global-pioneers-reduction-of-air-pollution-caused-by-construction-activities-in-partnership-with-ceew","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/signature-global-pioneers-reduction-of-air-pollution-caused-by-construction-activities-in-partnership-with-ceew\/","title":{"rendered":"Signature Global pioneers reduction of Air Pollution caused by construction activities in partnership with CEEW"},"content":{"rendered":"\n<p>In a move towards reducing air pollution caused by construction activities, Signature Global India Limited and the Council on Energy, Environment, and Water (CEEW) have joined hands to sign a Memorandum of Understanding (MoU). The collaboration aims to find effective solutions that can reduce the adverse effects of construction activities on local air quality under the &#8216;Cleaner Air and Better Health&#8217; (CABH) project, which is supported by the United States Agency for International Development (USAID).<\/p>\n\n\n\n<p>As a socially responsible developer that promotes sustainable development, Signature Global India Limited is committed to upholding international standards of environmental management. The company holds an ISO 14001 certification, which lays out the requirements for an effective environmental management system (EMS). Additionally, Signature Global India Limited is an active member of the Indian Green Building Council (IGBC) and has achieved IGBC Gold ratings for nine of its projects. IGBC Green Homes is India&#8217;s first rating program, exclusively designed for the residential sector. It is based on established energy and environmental principles and balances proven practices with emerging concepts.<\/p>\n\n\n\n<p>Few months ago, the Haryana pollution control board also took a significant step towards ensuring that construction sites do their part in reducing pollution. They have introduced a new scoring system that will grade construction sites larger than 500 sqm based on their performance in 29 different parameters related to pollution. This system will work similarly to the air quality index, with sites being categorized as poor, satisfactory, very good, or excellent based on their score.<\/p>\n\n\n\n<p>Taking this into consideration and as part of the company’s ongoing green initiative this project&#8217;s is another step in the same direction with its primary focus on assessing the efficacy of self-regulation of emissions from construction activities and the use of behavioral nudges on construction sites to curb air pollution. The network comprises of nine air quality monitors and one automatic weather station. The data captured by the network will be made available to project developers and the research team through a dashboard that will track pollution concentrations during different on-site construction activities.<\/p>\n\n\n\n<p>The pilot is expected to set a new precedent for clean and green construction practices and encourage other real estate developers to follow suit.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In a move towards reducing air pollution caused by construction activities, Signature Global India Limited and the Council on Energy, Environment, and Water (CEEW) have joined hands to sign a Memorandum of Understanding (MoU). The collaboration aims to find effective solutions that can reduce the adverse effects of construction activities on local air quality under&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4815,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4814"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4814"}],"version-history":[{"count":1,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4814\/revisions"}],"predecessor-version":[{"id":4816,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4814\/revisions\/4816"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4815"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4814"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4814"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4814"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}