{"id":4821,"date":"2023-05-16T09:50:41","date_gmt":"2023-05-16T09:50:41","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4821"},"modified":"2023-06-12T05:39:56","modified_gmt":"2023-06-12T05:39:56","slug":"stilt-plus-four-floors-policy-a-win-win-option-for-developers-and-customers-both","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/stilt-plus-four-floors-policy-a-win-win-option-for-developers-and-customers-both\/","title":{"rendered":"Stilt-plus-four-floors policy, a win-win option for developers and customers both"},"content":{"rendered":"\n<p>The population of Gurgaon has unexpectedly grown in the past two decades, and it is fair to say that the state&#8217;s planning department has failed to keep up with the increasing infrastructure demand of the city. The government realized early on that group housing was the only way to meet the housing demands of the growing population and therefore promoted high-rise apartments instead of plotted townships. However, by then, the Haryana government had already developed almost fifty plotted townships in Gurgaon, and many more were developed by private promoters. These plots allowed only three floors. Over the last fifteen years, Gurgaon&#8217;s population has grown by more than two lakhs per year, creating a demand for housing.<\/p>\n\n\n\n<p>As the population in plotted townships grew due to family splits, there was a need for an additional floor on each plot, inevitably. Due to the skyrocketing land prices in Gurgaon, constructing an additional floor on or above the third floor was preferable to buying a separate plot and erecting a separate apartment.<\/p>\n\n\n\n<p>Consequently, there was a growing demand for an additional floor or fourth floor – stilt plus four. The state government finally agreed and allowed the registry of the fourth floor, which was considered a milestone in Haryana since it brought significant comfort to families who needed to construct an additional fourth-floor as per their family&#8217;s demand. The step also opened up the possibility of accommodating more families in new buildings to be erected on plots. The government&#8217;s move came after a well-thought-out and ground report of the situation in Gurgaon, which is witnessing a huge demand for housing with every passing day.<\/p>\n\n\n\n<p>The reason the fourth floor was allowed was that the independent floor became a big hit in Gurgaon with homebuyers, mainly from the mid-segment, preferring independent floors with separate registry and privacy at a pocket-friendly budget, which was impossible earlier. Many real estate promoters launched independent floor projects in Gurgaon&#8217;s new sectors along Dwarka Expressway and Sohna and were looking to tap into emerging areas such as Farukhnagar and Pataudi, besides Sohna. Since the NCR Planning Board has focused on Gurgaon in terms of road\/rail infrastructure planning, urban corridors have become the need of the hour.<\/p>\n\n\n\n<p>Gurgaon is now well connected with neighboring states, and its real estate potential, as well as industrial scope, is believed to have increased significantly. In addition to KMP, Gurgaon Alwar Highway, and Dwarka Expressway, the Delhi Mumbai corridor will open up industrial and freight corridors between South and North India, and Gurgaon will be a focus because this city is a hub of automobile and garment industries besides IT and MNCs.<\/p>\n\n\n\n<p>In such a scenario, the Haryana government&#8217;s fourth floor policy was a well-conceived move and, given the rising housing needs, a win-win situation for all three stakeholders such as homebuyers, promoters, and the government as well. In the near future, Gurgaon will have a world-class global city, huge rail networks, Asia&#8217;s largest jungle safari, an artificial lake, and the landscaping of the Najafgarh wetland and the population is expected to increase rapidly, leading to a greater need for housing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The population of Gurgaon has unexpectedly grown in the past two decades, and it is fair to say that the state&#8217;s planning department has failed to keep up with the increasing infrastructure demand of the city. The government realized early on that group housing was the only way to meet the housing demands of the&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4822,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4821"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4821"}],"version-history":[{"count":1,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4821\/revisions"}],"predecessor-version":[{"id":4823,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4821\/revisions\/4823"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4822"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4821"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4821"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4821"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}