{"id":4830,"date":"2023-05-22T07:50:48","date_gmt":"2023-05-22T07:50:48","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4830"},"modified":"2023-06-12T05:33:04","modified_gmt":"2023-06-12T05:33:04","slug":"rera-brings-new-transparency-accountability-and-teinforces-trust","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/rera-brings-new-transparency-accountability-and-teinforces-trust\/","title":{"rendered":"RERA Brings New Transparency, Accountability, and Teinforces Trust"},"content":{"rendered":"\n<p>The real estate (regulation and development) act is a tool, rather than an act, designed to tighten the noose on defaulting builders. It did not come easily to its present shape in the form of acts and regulations. It has come about in response to volumes of complaints and grievances from home buyers who felt helpless after booking units in real estate projects across the country.<\/p>\n\n\n\n<br>\n\n\n\n<p>Buying property from a real estate promoter was treated more or less as a mutual agreement between the two parties, similar to buying something from a shop, where the buyer cannot claim if the product is not good or if they feel cheated. So, this sector was largely abandoned in this way, and in case of a dispute, aggrieved persons moved to consumer court, civil court, or elsewhere. More or less, for the buyer, it led to a feeling of helplessness.<\/p>\n\n\n\n<br>\n\n\n\n<p>The RERA was long-awaited in the country, believed to have answered all the anger of buyers or allottees, and that is true to a great extent. Now, builders cannot easily escape from the net. Once a builder-buyer agreement is signed and the booking amount is accepted in the bank account, the promoters are under the RERA net. The builder-buyer agreement is a tool that guarantees a buyer&#8217;s status as an allottee, defined in the Act, and gives them the right to move to the RERA court against the builder in case of an adverse situation. So, this is a milestone achievement of the government at the Centre for bringing this regulation that has streamlined the real estate sector since 2016. The real estate sector has three major stakeholders – promoters, allottees, and agents – and the Act deals with all three, holding them responsible for improving the real estate culture equally.<\/p>\n\n\n\n<br>\n\n\n\n<p>This Act makes it mandatory for promoters to register their projects with the RERA and put every single detail about the project in the public domain for transparency. Once a promoter and allottee have entered into an agreement, neither can run away from their responsibility and accountability. A promoter cannot lie now, unlike in the past, because every detail of the project is under the scanner of the RERA, ensuring buyers’ money is safe and secure. A promoter cannot, unlike in the past, misuse the money realized from the allottees. For every fault, the promoter will have to pay a penalty as per the Act, and if the fault lies on the part of the allottee, the Act treats them with a penalty as well. Thus, the Real Estate (Regulation and Development) Act has come as a big relief for property buyers and thereby restored the faith between stakeholders.<\/p>\n\n\n\n<br>\n\n\n\n<p>Allottees have every right to know about the progress of the project and pay only if satisfied with the progress of construction at the site and file an appeal if needed in the RERA court in Gurugram to bring it to the court’s notice. This development is revolutionary since trust was missing, and it was believed that builders were making money from this sector only by hook and crook.<\/p>\n\n\n\n<br>\n\n\n\n<p>But this perception has now changed in the past five years. A real estate promoter such as Signature Global has bagged awards from the state government for the best performance by delivering projects before and on time to the satisfaction of the allottee. Signature Global’s flat and floor projects have been a great help for home buyers for two strong reasons – one, it is budget-friendly, and second, projects are at all prime locations in Gurgaon alongside Dwarka expressway and Sohna-Alwar highway.<\/p>\n\n\n\n<br>\n\n\n\n<p>More than six hundred real estate projects and two thousand real estate agents are registered with the Haryana-RERA Gurugram. Haryana-RERA has received more than twenty-five thousand complaints from the Gurgaon allottees in the past five years, of which fifty percent of the complaints have been disposed of by the court. Every day, the court hears eighty to ninety cases and decides fifteen to twenty daily – a stupendous task by the bench, but it has reinstated trust in the real estate market, and buyers are feeling safe. Yet, a prospective property buyer has to remain alert before booking a unit – the market credibility of the promoter\/developer is the first and foremost criterion one has to think of and then no booking should be done through any unregistered agents at all. That way, Signature Global’s market credibility is perfect and trustworthy, and all its floors and flats are safe to be booked.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The real estate (regulation and development) act is a tool, rather than an act, designed to tighten the noose on defaulting builders. It did not come easily to its present shape in the form of acts and regulations. It has come about in response to volumes of complaints and grievances from home buyers who felt&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4841,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4830"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4830"}],"version-history":[{"count":4,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4830\/revisions"}],"predecessor-version":[{"id":4835,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4830\/revisions\/4835"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4841"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4830"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4830"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4830"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}