{"id":4836,"date":"2023-05-22T07:55:11","date_gmt":"2023-05-22T07:55:11","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=4836"},"modified":"2023-06-12T05:28:36","modified_gmt":"2023-06-12T05:28:36","slug":"green-housing-a-need-of-hour-for-real-estate-and-environment-both","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/green-housing-a-need-of-hour-for-real-estate-and-environment-both\/","title":{"rendered":"Green Housing – A need of hour for real estate and environment both"},"content":{"rendered":"\n<p>Real estate construction is a significant contributor to air pollution, adding to global warming and posing a potential threat to the planet. To address this challenge and secure a safe and sustainable future, the need of the hour is to adopt sustainable solutions like the zero waste concept and green building norms. The responsibility of ensuring that these norms are practiced in letter and spirit lies with the three major stakeholders: property buyers, promoters, and the government. Implementing these norms will not only create a safe and healthy environment but also promote good health.<\/p>\n\n\n\n<br>\n\n\n\n<p>Currently, many hazardous items are disposed of improperly, such as solid waste, sewage, and electronic waste, which can cause severe damage to air, water, and soil, leading to adverse health effects. The concept of green housing or zero waste discharge is an inevitable solution to control the damage already done and improve the current situation.<\/p>\n\n\n\n<br>\n\n\n\n<p>In urban areas, large-scale construction exacerbates the pollution problem. However, growing awareness about the environment among people is a positive sign. Individuals now desire at least one dwelling unit for better living and are becoming increasingly conscious about their children&#8217;s future. It is our responsibility to protect our climate and improve the situation since climate change is a global concern. The Intergovernmental Panel on Climate Change (IPCC) has been expressing concerns and urging countries to adopt strong mechanisms to control greenhouse gas emissions.<\/p>\n\n\n\n<br>\n\n\n\n<p>The Confederation of Real Estate Industry of India (Credai) has partnered with the Indian Green Building Council (IGBC) to construct four thousand green projects. This move is a welcoming step aimed at creating a sustainable built environment. Signature Global, as a real estate promoter, has done a commendable job by adopting the green housing concept fully in all its housing projects across the city, promoting green building and zero waste discharge, and helping to improve the environment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real estate construction is a significant contributor to air pollution, adding to global warming and posing a potential threat to the planet. To address this challenge and secure a safe and sustainable future, the need of the hour is to adopt sustainable solutions like the zero waste concept and green building norms. The responsibility of&#8230;<\/p>\n","protected":false},"author":1,"featured_media":4842,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4836"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=4836"}],"version-history":[{"count":1,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4836\/revisions"}],"predecessor-version":[{"id":4837,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/4836\/revisions\/4837"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/4842"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=4836"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=4836"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=4836"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}