{"id":5225,"date":"2023-09-20T11:06:56","date_gmt":"2023-09-20T11:06:56","guid":{"rendered":"https:\/\/www.signatureglobal.in\/blog\/?p=5225"},"modified":"2023-09-20T11:08:05","modified_gmt":"2023-09-20T11:08:05","slug":"the-indian-real-estate-dilemma-rising-house-prices-vs-dwindling-affordability","status":"publish","type":"post","link":"https:\/\/www.signatureglobal.in\/blog\/the-indian-real-estate-dilemma-rising-house-prices-vs-dwindling-affordability\/","title":{"rendered":"The Indian Real Estate Dilemma: Rising House Prices vs. Dwindling Affordability"},"content":{"rendered":"\n<figure class=\"wp-block-gallery has-nested-images columns-default is-cropped wp-block-gallery-1 is-layout-flex\">\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"800\" height=\"600\" data-id=\"5227\"  src=\"https:\/\/www.signatureglobal.in\/blog\/wp-content\/uploads\/2023\/09\/Industry-News-19th-sep-1.jpg\" alt=\"\" class=\"wp-image-5227\"\/><\/figure>\n<\/figure>\n\n\n\n<br>\n\n\n\n<p>Gurgaon is one of the leading real estate destinations in our country, and its common knowledge that the real estate sector has emerged as a sector of great importance for various reasons, especially in recent years. As we know, affordable housing in Gurgaon has become a significant trend among the low and mid-segment class, who largely constitute the end-users. Even during periods of sluggishness in the property sector and a drop in overall property demand in real estate, the demand for affordable housing in Gurgaon and other parts of NCR has remained relatively stable. This reflects that a large section of the society in Gurgaon still resides in rented houses due to their inability to afford houses in premium societies, primarily because of the high property prices.<\/p>\n\n\n\n<br>\n\n\n\n<p>There is no doubt that affordable housing has emerged as a much better option for the low and mid-segment population compared to luxurious housing in Gurgaon, a cosmopolitan city where property prices are skyrocketing. The affordability of residential properties also makes them attractive for rental prospects. The Haryana state government had to address the issue of housing for all, which was a pressing need, as Gurgaon experienced a massive population explosion with more than two lakh people settling in the city every successive year. This population influx strained existing infrastructure and led to the proliferation of illegal colonies, tarnishing the city&#8217;s reputation as a city of skyscrapers.<\/p>\n\n\n\n<br>\n\n\n\n<p>Initially launched to provide cheaper homes to low- and mid-income families, the affordable housing scheme is now facing significant challenges. Homebuyers are increasingly turning away from the affordable housing segment, causing its share in the overall residential real estate market to steadily decline. This decline can be attributed to multiple factors, including the fact that the facilities in residential housing societies governed by the affordable housing policy are notably less in comparison to non-affordable societies. Affordable societies also tend to have a much higher population density, leading to concerns such as vehicle parking and maintenance disputes. Despite the government granting relaxations to real estate developers under the affordable housing policy, rising land and construction material prices are major constraints for builders.<\/p>\n\n\n\n<br>\n\n\n\n<p>In response to these challenges, the Haryana state government has significantly increased the cap to attract developers to build houses within a budget range suitable for the low and mid-segment population, which constitutes a substantial part of the city&#8217;s population. To strike a balance between skyscrapers and low-rise buildings, the government has allowed for stilt-plus-four-story construction on independent land in budget-friendly developments.<\/p>\n\n\n\n<br>\n\n\n\n<p><a href=\"https:\/\/www.signatureglobal.in\/\"><u><strong><u>Signature Global<\/u><\/strong><\/u><\/a>, a trusted real estate developer in Gurgaon, has been at the forefront of addressing the housing needs of this significant section of the society and continues to lead the city in this regard.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gurgaon is one of the leading real estate destinations in our country, and its common knowledge that the real estate sector has emerged as a sector of great importance for various reasons, especially in recent years. As we know, affordable housing in Gurgaon has become a significant trend among the low and mid-segment class, who&#8230;<\/p>\n","protected":false},"author":1,"featured_media":5226,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/5225"}],"collection":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/comments?post=5225"}],"version-history":[{"count":1,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/5225\/revisions"}],"predecessor-version":[{"id":5228,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/posts\/5225\/revisions\/5228"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media\/5226"}],"wp:attachment":[{"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/media?parent=5225"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/categories?post=5225"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.signatureglobal.in\/blog\/wp-json\/wp\/v2\/tags?post=5225"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}